controllers/LaporanController.php

    public function actionExportLaporanBulanan($id_tahun,$id_bulan){
        if(($modelHasilAkhir = VHasilAkhir::find()->where(['id_bulan'=>$id_bulan])->andWhere(['id_tahun'=>$id_tahun])->all()) !== null){
---
SELECT * FROM `v_hasil_akhir` WHERE (`id_bulan`='1') AND (`id_tahun`='1')

    public function actionDetailBulanan(){

        if (Yii::$app->request->isAjax) {
            $data           = Yii::$app->request->post();
            $tahun          = $data['id_tahun'];
            $bulan          = $data['id_bulan'];
            $modelHasilAkhir = VHasilAkhir::find()->where(['id_bulan'=>$bulan])->andWhere(['id_tahun'=>$tahun])->all();
---
SELECT * FROM `v_hasil_akhir` WHERE (`id_bulan`='1') AND (`id_tahun`='1')

    public function actionBulanan(){

        $listBulan = ModelBulan::ambilSemuaBulan();
        $listTahun = ArrayHelper::map(TTahun::find()->asArray()->all(), 'id', 'tahun');
---
SELECT * FROM `t_tahun`