controllers/PenilaianController.php

    public function actionCariDataKaryawan(){
        $data = Yii::$app->request->post();
        $bulan = $data['bulan'];
        $tahun = $data['tahun'];
        $jumlahKriteria = TKriteria::find()->asArray()->all();
        $listKaryawan = TKaryawan::find()->asArray()->all();
---
SELECT * FROM `t_kriteria` WHERE `id` IN ('1', '4', '2', '3')
SELECT * FROM `t_karyawan`