controllers/PenilaianController.php

SELECT `t_penilaian`.* FROM `t_penilaian` LEFT JOIN `t_karyawan` ON `t_penilaian`.`id_karyawan` = `t_karyawan`.`id` LEFT JOIN `t_kriteria` ON `t_penilaian`.`id_kriteria` = `t_kriteria`.`id` WHERE (`id_bulan` = '1') AND (`id_tahun` = '1') AND (`id_karyawan`='16')
---
    public function actionCariDataKaryawan(){
        $data = Yii::$app->request->post();
        $bulan = $data['bulan'];
        $tahun = $data['tahun'];
        $cariTahun = TTahun::findOne($tahun);
        $jumlahKriteria = TPeriodeKriteria::find()
            ->joinWith(['tahunValidStart as idTahunValidStart','tahunValidEnd as idTahunValidEnd'])
            ->where('STR_TO_DATE(:bulanTahun, "%Y-%m") BETWEEN STR_TO_DATE(CONCAT(idTahunValidStart.tahun,"-",id_bulan_valid_start), "%Y-%m") AND STR_TO_DATE(CONCAT(idTahunValidEnd.tahun,"-",id_bulan_valid_end), "%Y-%m")',
                [':bulanTahun'=>$cariTahun->tahun.'-'.$bulan
        ])->all();
        $listKaryawan = TKaryawan::find()->asArray()->all();
        foreach ($listKaryawan as $key => $value) {
            $listPenilaian = TPenilaian::find()->where(
                [
                    'AND',
                    ['=','id_bulan',$bulan],
                    ['=','id_tahun',$tahun],
                ]
            )->andWhere(['id_karyawan' => $value['id']])
            ->asArray()
            ->all();