controllers/SiteController.php

SELECT * FROM `t_kriteria`
SELECT * FROM `t_gambar` ORDER BY `datetime` DESC
---
    public function actionIndex()
    {
       // $this->layout = "kosong";
        $model = TKriteria::find()->all();
        $listGambar = TGambar::find()->orderBy(['datetime'=>SORT_DESC])->all();