controllers/UserController.php

    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null) {
---
SELECT * FROM `t_user` WHERE `id`='4'