models/TKaryawan.php

    public function ambilSemuaKaryawan(){
        return self::find()->asArray()->all();
---
SELECT * FROM `t_karyawan`