models/TKriteria.php

SELECT * FROM `t_kriteria`
---
    public static function ambilSemuaBobot($id = null){
        $query = self::find()->select('SUM(bobot) as jumlah');
        if ($id != null) {
            $query = $query->where(['!=','id',$id]);
        }
        $query = $query->asArray()->one();