models/TPenilaian.php

    public function rules()
    {
        return [
            [['id_karyawan', 'id_kriteria', 'id_bulan', 'id_tahun', 'nilai'], 'required'],
            [['id_karyawan', 'id_kriteria', 'id_bulan', 'id_tahun', 'bobot_saat_ini'], 'integer'],
            [['create_at', 'update_at','nilai_normalisasi'], 'safe'],
            [['id_karyawan'], 'exist', 'skipOnError' => true, 'targetClass' => TKaryawan::className(), 'targetAttribute' => ['id_karyawan' => 'id']],
            [['id_bulan'],'in','range'=>array_keys(ModelBulan::ambilSemuaBulan())],
            [['id_tahun'], 'exist', 'skipOnError' => true, 'targetClass' => TTahun::className(), 'targetAttribute' => ['id_tahun' => 'id']],
            [['id_kriteria'], 'exist', 'skipOnError' => true, 'targetClass' => TKriteria::className(), 'targetAttribute' => ['id_kriteria' => 'id']],
           // [['bobot_saat_ini'], 'bobotNilaiValidator'],
            [['bobot_saat_ini'],'default','value'=>function($attribute, $params){
                $inputTahunBulan = $this->id_tahun.$this->id_bulan;
                $kriteria = TKriteria::find()->where(['id'=>$this->id_kriteria])->andWhere(['<=','CONCAT(id_tahun_valid_start,"",id_bulan_valid_start)',$inputTahunBulan])->andWhere(['>=','CONCAT(id_tahun_valid_end,"",id_bulan_valid_end)',$inputTahunBulan])->one();
                if ($kriteria == null) {
                    $errorMessage = 'Bobot Nilai Tidak Ditemukan, Silahkan Periksa tanggal valid Bobot Pada Kriteria '.$this->idKriteria->kriteria;
                    $this->addError('bobot_saat_ini','Error');
                    Yii::$app->session->setFlash('danger', $errorMessage);
                    return false;
                }
                return $this->idKriteria->bobot;
           }],
---
SELECT * FROM `t_kriteria` WHERE `id`='6'

    public function afterSave ( $insert, $changedAttributes ){
        //mencari nilai tertinggi pada tahun, bulan dan kriteria yang diinputkan
        $nilaiTertinggi = TPenilaian::find()->select('MAX(nilai) AS nilaiMax')
                          ->where(['id_tahun'=>$this->id_tahun])
                          ->andWhere(['id_bulan'=>$this->id_bulan])
                          ->andWhere(['id_kriteria'=>$this->id_kriteria])
                          ->asArray()->one();
---
SELECT MAX(nilai) AS nilaiMax FROM `t_penilaian` WHERE (`id_tahun`='1') AND (`id_bulan`='1') AND (`id_kriteria`='6')