models/TTahun.php

    public static function ambilSemuaTahun(){
        return self::find()->orderBy(['id'=>SORT_ASC])->all();
---
SELECT * FROM `t_tahun` ORDER BY `id`