models/VHasilAkhir.php

SELECT * FROM `v_hasil_akhir` WHERE (`id_bulan`=1) AND (`id_tahun`=2) ORDER BY `total` DESC
---
    public static function ambilRanking(array $data){
        if(($model = self::find()->where(['id_bulan'=>$data['id_bulan']])->andWhere(['id_tahun'=>$data['id_tahun']])->orderBy(['total'=>SORT_DESC])->all()) !== null){